Revit 2024 API
VertexPosition Constructor
 Constructs the vertex from a point.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public VertexPosition(
	XYZ position
)
Visual Basic
Public Sub New ( _
	position As XYZ _
)
Visual C++
public:
VertexPosition(
	XYZ^ position
)
Parameters
position
Type: Autodesk.Revit.DB.XYZ
 The vertex's position.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
VertexPosition Class
Autodesk.Revit.DB.DirectContext3D Namespace